#include <stdio.h>
#include <locale.h>

int main() {
    float a, b;
    char c = "-", d = "_";
    setlocale(LC_ALL, "RUS");
    printf("Введите первое вещественное число (a): ");
    scanf_s("%f", &a);
    printf("Введите второе вещественное число (b): ");
    scanf_s("%f", &b);
    printf("---------------------------------------------------\n");
    printf("|     a * b     |       a+b        |     a-b      |\n");
    printf("--------------------------------------------------|\n");
    printf("| %5.1f * %5.1f |   %5.1f + %5.1f  | %5.1f - %5.1f|\n", a,b,a,b,a,b);
    printf("--------------------------------------------------|\n");
    printf("|      %5.1f    |       %5.1f      |    %5.1f     |\n", a * b, a + b, a - b);
    printf("---------------------------------------------------\n");
    return 0;
}
