#include <stdio.h>
#include <locale.h>
int main() {
	setlocale(LC_ALL, "RUS");
	printf("%20s\n", "Этот текст справа");
	printf("%-20s\n", "Этот текст слева");
	printf("\t%20s\n", "Этот текст табулирован");
	puts("*******************************************************************************************");
	printf("123\n");
	puts("");
	printf(" %d\n %d\n %d\n", 1, 2, 3);
	puts("");
	printf(" %d\n\t %d\n\t\t %d\n", 1, 2, 3);
	puts("");
	printf("%d %d %d %d\n", 1, 2, 3, 4);
	puts("");
	printf("%4d\n %5d\n %6d\n %7d\n", 1, 2, 3, 4);
	puts("*******************************************************************************************");
	printf("%10.3f\n", 12.234657);
	puts("");
	printf("%10.5f\n", 12.234657);
	puts("*******************************************************************************************");
	printf("Остаток от деления %d на %d равен %d\n", 5, 2, 5 % 2);
	puts("");
	printf("Результат деления 7 на 5 равен %d\n", 7 / 5);
	puts("");
	printf("Результат умножения 2000 на 4 равен %d\n", 2000 * 4);
	puts("*******************************************************************************************");
	printf("%g разделить на %e равно %f\n ", 5., 2., 5. / 2);
	puts("");
	printf("%d разделить на %d равно %d\n ", 5, 2, 5 / 2);         // d Для целых чисел
	puts("");
	printf("%f разделить на %f равно %f\n ", 5.0, 2.0, 5.0 / 2.0); // f Для дробных чисел
	puts("");
	printf("%g разделить на %g равно %g\n ", 5.0, 2.0, 5.0 / 2.0); // g выбирает %f or %e, что короче
	puts("");
	printf("%e разделить на %e равно %e\n ", 5.0, 2.0, 5.0 / 2.0); // e Для научного представления
}