#include <stdio.h>
#include <locale.h>
int main() {
	setlocale(LC_ALL, "RUS");
	printf("%20s\n", "Этот текст справа");
	printf("%-20s\n", "Этот текст слева");
	printf("\t%20s\n", "Этот текст табулирован");
	puts("");
	printf("%10.3f\n", 12.234657);
	printf("%10.5f\n", 12.234657);
	puts("");
	printf("Остаток от деления %d на %d равен %d\n", 5, 2, 5 % 2);
	printf("Результат деления 7 на 5 равен %f\n", 7.0 / 5.0);
	printf("Результат умножения 2000 на 4 равен %d\n", 2000 * 4);
	puts("");
	printf("%g разделить на %e равно %f\n ", 5., 2., 5. / 2);
	printf("%d разделить на %d равно %d\n ", 5, 2, 5 / 2); // d Для целых чисел
	printf("%f разделить на %f равно %f\n ", 5.0, 2.0, 5.0 / 2.0); // f Для дробных чисел
	printf("%g разделить на %g равно %g\n ", 5.0, 2.0, 5.0 / 2.0); // g выбирает %f or %e, что короче
	printf("%e разделить на %e равно %e\n ", 5.0, 2.0, 5.0 / 2.0); // e Для научного представления
}